OdRxHierarchyLevelAttribute.value(OdRxValue*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves a string describing CDA hierarchy level of the specified value.
\returns
String describing CDA hierarchy level of this node (e.g. 'Model', 'Block').

OdRxHierarchyLevelAttribute.defaultValue
\details
Retrieves a string describing CDA hierarchy level of this node.
\returns
String describing CDA hierarchy level of this node (e.g. 'Model', 'Block').

OdRxHierarchyLevelAttribute.createObject(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Constructor. Creates an attribute of the OdRxHierarchyLevelAttribute type.
\param value [in]  String describing CDA hierarchy level of this node.
\returns
Smart pointer to a constructed attribute object.